// 수행평가 데이터
export const evaluations = [
  {
    subject: "미적분",
    title: "수능 기출의 미래 풀어오기",
    highlightColor: 'rgb(97, 233, 93)',
    images: [],
    classDates: {
      "1": "025-04-30",
      "2": "025-04-30",
      "3": "025-04-30",
      "4": "2025-04-30",
      "5": "025-04-30",
      "6": "025-04-30",
      "7": "025-04-30",
      "8": "025-04-30"
    },
    defaultDate: "2025-04-30",
    details: {
      type: "숙제",
      deadline: "",
      requirements: [
        "135번까지 풀어오기"
      ],
      materials: [
        "수능 기출의 미래"
      ],
      notes: "수기미 풀이 숙제입니다"
    }
  },
  {
    subject: "프로그래밍",
    title: "3학년 프로그래밍 수행평가",
    highlightColor: "#ffeb3b",
    images: [],
    classDates: {
      "1": "2025-06-09",
      "2": "2025-06-09",
      "3": "2025-06-09",
      "4": "2025-06-09",
      "5": "2025-06-09",
      "6": "2025-06-09",
      "7": "2025-06-09",
      "8": "2025-06-09"
    },
    defaultDate: "2025-06-09",
    details: {
      type: "보고서",
      deadline: "2025-06-0911:00",
      requirements: [
        "보고서 양식에 맞추어 보고서 작성"
      ],
      materials: [
        "코딩 보고서"
      ],
      notes: "양식과 채점 기준을 잘 확인하세요."
    }
  },
  {
    subject: "영단어",
    title: "전도언T 영단어 수행평가",
    highlightColor: "#ffeb3b",
    images: [],
    classDates: {
      "1": "2025-05-01",
      "2": "2025-05-01",
      "3": "2025-05-01",
      "4": "2025-05-01",
      "5": "2025-05-01",
      "6": "2025-05-01",
      "7": "2025-05-01",
      "8": "2025-05-01"
    },
    defaultDate: "2025-05-01",
    details: {
      type: "단어 시험",
      deadline: "2025-05-01T08:50",
      requirements: [
        "영단어 18p, 19p, 20p"
      ],
      materials: [
        "볼펜"
      ],
      notes: "x"
    }
  },
  {
    "subject": "미적분 수1",
    "title": "수능특강 수1 3단원, 4단원 문제풀이 수행평가",
    "highlightColor":"rgb(50, 186, 57)",
    "images": [],
    "classDates": {
      "1": "2025-05-07",
      "2": "2025-05-07",
      "3": "2025-05-07",
      "4": "2025-05-07",
      "5": "2025-05-07",
      "6": "2025-05-07",
      "7": "2025-05-07",
      "8": "2025-05-07"
    },
    "defaultDate": "2025-05-07",
    "details": {
      "type": "숙제",
      "deadline": "2025-05-07",
      "requirements": [
        "수능특강 수1 3단원, 4단원 문제를 공책에 풀어 오세요."
      ],
      "materials": [
        "풀이과정이 적힌 노트"
      ],
      "notes": "단원의 제목은 빨간 볼펜으로 작성하여야 합니다."
    }
  }
]; 